# CurveExtents Class

---
Represents the start and end parameters for a curve segment.
SystemObject Autodesk.Revit.DBCurveExtents
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class CurveExtents : IDisposable

    Public Class CurveExtents
    	Implements IDisposable

    public ref class CurveExtents : IDisposable

    type CurveExtents =
        class
            interface IDisposable
        end
The CurveExtents type exposes the following members.
| Name| Description
---|---|---
| EndParameter|  The end parameter of the curve extents.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| StartParameter|  The start parameter of the curve extents.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the CurveExtents
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace